Res-social/Res-container-set-v1/container_t_10_c_30_readHomeTimeline_composeCore_2_wrkCore_1/wrk.txt
Running 1m test @ http://localhost:8080/wrk2-api/home-timeline/read
  10 threads and 30 connections
  Thread calibration: mean lat.: 2971.622ms, rate sampling interval: 9773ms
  Thread calibration: mean lat.: 2521.822ms, rate sampling interval: 8994ms
  Thread calibration: mean lat.: 3832.941ms, rate sampling interval: 15876ms
  Thread calibration: mean lat.: 2552.443ms, rate sampling interval: 8970ms
  Thread calibration: mean lat.: 4342.055ms, rate sampling interval: 17137ms
  Thread calibration: mean lat.: 3380.455ms, rate sampling interval: 12886ms
  Thread calibration: mean lat.: 2557.385ms, rate sampling interval: 8945ms
  Thread calibration: mean lat.: 3680.196ms, rate sampling interval: 15384ms
  Thread calibration: mean lat.: 2527.574ms, rate sampling interval: 8994ms
  Thread calibration: mean lat.: 2543.766ms, rate sampling interval: 9019ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.40s    14.94s    0.96m    58.49%
    Req/Sec    24.49      6.39    37.00     73.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.69s 
 75.000%   44.53s 
 90.000%    0.85m 
 99.000%    0.96m 
 99.900%    0.99m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      60.095     0.000000            1         1.00
   10698.751     0.100000         1268         1.11
   16130.047     0.200000         2535         1.25
   21364.735     0.300000         3802         1.43
   26492.927     0.400000         5070         1.67
   31686.655     0.500000         6339         2.00
   34766.847     0.550000         6978         2.22
   37224.447     0.600000         7603         2.50
   39878.655     0.650000         8237         2.86
   42270.719     0.700000         8878         3.33
   44531.711     0.750000         9507         4.00
   45645.823     0.775000         9824         4.44
   46792.703     0.800000        10145         5.00
   47874.047     0.825000        10454         5.71
   48922.623     0.850000        10775         6.67
   49971.199     0.875000        11094         8.00
   50528.255     0.887500        11245         8.89
   51150.847     0.900000        11403        10.00
   51740.671     0.912500        11562        11.43
   52330.495     0.925000        11721        13.33
   52953.087     0.937500        11885        16.00
   53247.999     0.943750        11965        17.78
   53542.911     0.950000        12044        20.00
   53805.055     0.956250        12116        22.86
   54132.735     0.962500        12207        26.67
   54427.647     0.968750        12279        32.00
   54558.719     0.971875        12317        35.56
   54722.559     0.975000        12357        40.00
   54886.399     0.978125        12396        45.71
   55443.455     0.981250        12434        53.33
   56229.887     0.984375        12473        64.00
   56557.567     0.985938        12493        71.11
   56950.783     0.987500        12513        80.00
   57278.463     0.989062        12532        91.43
   57704.447     0.990625        12554       106.67
   58032.127     0.992188        12573       128.00
   58195.967     0.992969        12581       142.22
   58392.575     0.993750        12592       160.00
   58589.183     0.994531        12601       182.86
   58785.791     0.995313        12611       213.33
   58949.631     0.996094        12621       256.00
   59047.935     0.996484        12626       284.44
   59146.239     0.996875        12633       320.00
   59244.543     0.997266        12637       365.71
   59310.079     0.997656        12641       426.67
   59441.151     0.998047        12647       512.00
   59473.919     0.998242        12649       568.89
   59506.687     0.998437        12651       640.00
   59572.223     0.998633        12654       731.43
   59604.991     0.998828        12656       853.33
   59637.759     0.999023        12658      1024.00
   59670.527     0.999121        12660      1137.78
   59703.295     0.999219        12661      1280.00
   59736.063     0.999316        12662      1462.86
   59768.831     0.999414        12664      1706.67
   59768.831     0.999512        12664      2048.00
   59801.599     0.999561        12666      2275.56
   59801.599     0.999609        12666      2560.00
   59801.599     0.999658        12666      2925.71
   59834.367     0.999707        12668      3413.33
   59834.367     0.999756        12668      4096.00
   59834.367     0.999780        12668      4551.11
   59834.367     0.999805        12668      5120.00
   59834.367     0.999829        12668      5851.43
   59899.903     0.999854        12670      6826.67
   59899.903     1.000000        12670          inf
#[Mean    =    31397.856, StdDeviation   =    14936.689]
#[Max     =    59867.136, Total count    =        12670]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14744 requests in 1.00m, 204.87MB read
  Socket errors: connect 0, read 0, write 0, timeout 699
Requests/sec:    245.68
Transfer/sec:      3.41MB